[
    {
        "name": "Accessible HTML",
        "id": "1",
        "description": "Week 1's challenge involved editing an existing HTML and CSS file to be more accessible, adding alt tags to images as well as an aria-label for the hero banner image, which had been included using CSS rather than HTML (where alt tags could have been added). I have edited the title of the page to be more appropriate, and I have also condensed the CSS to include styles for particular nested elements, rather than having the same styles written for classes that are only applied once on a specific section of content.",
        "githubURL": "https://github.com/sarenne89/Accessible-HTML",
        "deployedURL": "https://sarenne89.github.io/Accessible-HTML",
        "imgPath": "./src/assets/img/accessible-html.png",
        "score": "99%"
    },
    {
        "name": "Flex-Grid Portfolio",
        "id": "2",
        "description": "In this challenge, we have been tasked with creating a portfolio page using flex and grid layouts. It includes links to our various project repositories and Github profile, as well as working links that navigate to the correct place on the page. It is also responsive, and includes a hero banner at the top of the page.",
        "githubURL": "https://github.com/sarenne89/Flex-Grid-Portfolio",
        "deployedURL": "https://sarenne89.github.io/Flex-Grid-Portfolio",
        "imgPath": "./src/assets/img/flex-grid-portfolio.png",
        "score": "100%"
    },
    {
        "name": "Bootstrap Portfolio",
        "id": "3",
        "description": "In this week's challenge, we were instructed to recreate our portfolio pages from Week 2, but this time using Bootstrap as much as possible. I have also included an extra section, as per the requirements, showing the skills and tasks we are undertaking and improving on each week during the course. I have included new links back to my msot recently created work, as well as new link stylings and social media icons. This portfolio will be a good place to show off the work that we complete each week and will be updated accordingly with new pieces of work to show my progress throughout the course. I can clearly see the advantages in using a framework such as Bootstrap for creating websites as the in-built classes are so useful as a time-saver. This allowed me to spend more time making minor changes to the appearance of the website rather than spending a long time on the layout as in week 2.",
        "githubURL": "https://github.com/sarenne89/bootstrap-portfolio",
        "deployedURL": "https://sarenne89.github.io/bootstrap-portfolio",
        "imgPath": "./src/assets/img/bootstrap-portfolio.png",
        "score": "100%"
    },
    {
        "name": "Console Finances",
        "id": "4",
        "description": "In this first Javascript challenge, we were instructed to perform a set of operations on an array with a given dataset, and for the results to be output to the console in a particular format.",
        "githubURL": "https://github.com/sarenne89/Console-Finances",
        "deployedURL": "https://sarenne89.github.io/Console-Finances",
        "imgPath": "./src/assets/img/console-finances.png",
        "score": "100%"
    },
    {
        "name": "Password Generator",
        "id": "5",
        "description": "In this weeks challenge, we have been tasked with creating a responsive page with a password generator. The password should include 8-128 characters from lowercase, uppercase, numeric and special characters chosen at random by the generator. The method I chose for this challenge was to give the user a series of confirm/prompts, and to put the data from those decisions into an object. I then used that object to determine which arrays should be used to create the password, and put those selected arrays into a new array. The program then generates the requested number of random characters from this array. In order to ensure that at least one character is chosen from each array, I have put in checks that test whether a character type has been selected, and if so a character from that array is spliced in at a specific index. The new password array is then shuffled randomly before being joined into a new string and displayed for the user.",
        "githubURL": "https://github.com/sarenne89/Password-Generator",
        "deployedURL": "https://sarenne89.github.io/Password-Generator",
        "imgPath": "./src/assets/img/password-generator.png",
        "score": "100%"
    },
    {
        "name": "Coding Quiz",
        "id": "6",
        "description": "In this weeks challenge we have been tasked with creating a coding quiz using Javascript and what we've learned so far about web APIs. There will be a a start button, a timer, and a series of questions with buttons for answers. Each time the right answer is clicked, the next question will appear. When the wrong answer is clicked, time will be removed from the timer. At the end of the quiz or when the timer reaches zero, the player will be taken to another page where they can input their name along with their high score, and this will be stored in local storage. I have included detailed descriptions of each individual function within the various javascript files.",
        "githubURL": "https://github.com/sarenne89/Coding-Quiz",
        "deployedURL": "https://sarenne89.github.io/Coding-Quiz",
        "imgPath": "./src/assets/img/coding-quiz.png",
        "score": "100%"
    },
    {
        "name": "Planner App",
        "id": "7",
        "description": "In this weeks challenge, we have been tasked with creating a daily planner app that includes the current date and various different time slots. These time slots can have data enterred in them, which can be saved and later retrieved on page refresh. The time slots will also change their styling depending on the time of day to give some visual cues to the user. This challenge includes use of Bootstrap, JQuery and dayjs().",
        "githubURL": "https://github.com/sarenne89/Planner-App",
        "deployedURL": "https://sarenne89.github.io/Planner-App",
        "imgPath": "./src/assets/img/planner-app.png",
        "score": "100%"
    },
    {
        "name": "Weather Dashboard",
        "id": "8",
        "description": "In this weeks challenge, we have been tasked with creating a weather dashboard using the OpenWeather API in order to display the current weather for any city that is searched by the user, along with a 5 day weather forecast and a search history that is saved and retrieved from local storage. Dayjs is also used to parse dates.",
        "githubURL": "https://github.com/sarenne89/Weather-Dashboard",
        "deployedURL": "https://sarenne89.github.io/Weather-Dashboard",
        "imgPath": "./src/assets/img/weather-dashboard.png",
        "score": "100%"
    },
    {
        "name": "Project 1 - Things To Do In My City",
        "id": "9",
        "description": "Have you ever travelled to a city and found it difficult to seek activities to do within the city? Have you gotten exhausted surfing the internet looking for events happening within the city? Well, I have good news because The Things To Do In My City app resolves this problem. It alleviates the burden of spending your free time looking for activities. Everything has been brought into one place for you, all you need is to type your location and what date you wish to engage in activities. Once you populate the required fields with information, the app shows you all the activities that will be happening in your city within the time period.",
        "githubURL": "https://github.com/sarenne89/TTDIMC",
        "deployedURL": "https://sarenne89.github.io/TTDIMC",
        "imgPath": "./src/assets/img/ttdimc.png",
        "score": "97%"
    },
    {
        "name": "README Generator",
        "id": "10",
        "description": "In this assignment, we have been tasked with creating a README Generator using Javascript, Node.js and ES6 syntax. We have also been recommended to use the npm Inquirer to ask the user questions in the command line, which is then used to generate a professional looking README.md file.",
        "githubURL": "https://github.com/sarenne89/README-Generator",
        "deployedURL": "",
        "imgPath": "./src/assets/img/readme-generator.png",
        "score": "100%"
    },
    {
        "name": "Team Profile Generator",
        "id": "11",
        "description": "In this task, we have been asked to create a team profile generator using Node and Inquirer. The user is asked questions in the command line in order to create profiles for a dev team, including a manager, engineers and interns, and then outputs that information into a new directory and html file.",
        "githubURL": "https://github.com/sarenne89/team-profile-generator",
        "deployedURL": "",
        "imgPath": "./src/assets/img/team-generator-screenshot.png",
        "score": "87%"
    },
    {
        "name": "React Portfolio",
        "id": "12",
        "description": "",
        "githubURL": "https://github.com/sarenne89/react-portfolio",
        "deployedURL": "",
        "imgPath": "./src/assets/img/react.png",
        "score": "Awaiting grading"
    }
]